# Завдання 1
# Напишіть промпт для генерації коду функції для
# вирішення певної задачі.
# Вхідні параметри – мова програмування, опис задачі
# Реалізуйте двома способами:
#  Zero-shot
#  Few-shot
import dotenv
import os
from langchain_google_genai import GoogleGenerativeAI
from langchain_core.prompts import PromptTemplate


dotenv.load_dotenv()
api_key = os.getenv("GEMINI_API_KEY")

llm = GoogleGenerativeAI(
    model="gemini-3.5-flash-lite",
    api_key=api_key,
)

# prompt = PromptTemplate.from_template("""
#     Ти -- асистент програміста.
#     Задача: згенерувати код на {language} для вирішення певної задачі.
#
#     ###ПРАВИЛА###
#     1. пиши тільки код
#     2. пиши простий код з поясненнями для початківців
#     3. розписуй максимально детально пояснення до кожного кроку
#
#     ###ПРИКЛАДИ###
#     ПРИКЛАД 1: напиши підрахунок калорій
#     ВІДХИЛИТИ
#
#     ПРИКЛАД 2: напиши функцію додавання 2 чисел
#     ВІДПОВІДЬ:
#     def add(a, b):
#         return a + b
#
#     ПРИКЛАД 3: напиши функцію віднімання 2 чисел
#     ВІДПОВІДЬ:
#     def minus(a, b):
#         return a - b
#
#
#     ###ОПИС ЗАДАЧІ###
#     {task}
# """)
#
# language = "Python"
# task = "простий калькулятор, +/-"
#
# data = {
#     "language": language,
#     "task": task
# }
#
# text = prompt.invoke(data)
#
# response = llm.invoke(text)
# print(response)

# Завдання 2
# Напишіть промпт для переведення тексту з
# неформального стилю в формальний
# Вхідні параметри – текст
# Реалізуйте двома способами:
#  Zero-shot
#  Few-shot

# prompt = PromptTemplate.from_template("""
#     Ти -- професійний редактор текстів.
#     Твоя задача полягатиме в перетворенні наведеного тексту із неформального стилю в формальний.
#
#     ###ВИМОГИ###
#     1. Збережи основний зміст оригінального тексту
#     2. Відповідь повинна бути не більше 3 речень
#     3. Виправ орфографічні та пунктуаційні помилки
#
#     ###ПРИКЛАДИ###
#     ### Приклад 1
#     **Вхід:**
#     > Привіт, я сьогодні не встиг доробити завдання, можна я здам його завтра?
#     **Вихід:**
#     > Добрий день. Сьогодні я не встиг завершити завдання. Чи можу я здати його завтра?
#
#     ### Приклад 2
#     **Вхід:**
#     > Слухай, я взагалі не шарю, як це зробити. Можеш підказати?
#     **Вихід:**
#     > Я не зовсім розумію, як виконати це завдання. Чи могли б ви надати мені пояснення?
#
#     ### Приклад 3
#     **Вхід:**
#     > Привіт, я трохи запізнюсь, бо автобус знову довго їде.
#     **Вихід:**
#     > Добрий день. Я трохи запізнюся через затримку громадського транспорту. Перепрошую за незручності.
#
#     ### Приклад 4
#     **Вхід:**
#     > Я не прийду сьогодні, бо щось погано себе почуваю. Що там буде на парі?
#     **Вихід:**
#     > Сьогодні я не зможу бути присутнім на занятті через погане самопочуття. Будь ласка, повідомте, які теми будуть розглядатися.
#
#     ###ВХІДНІ ПАРАМЕТРИ###
#     {text}
#
# """)
#
# input_text = "Можеш скинути мені ту штуку, яку ми вчора робили? Я щось не зберіг."
#
# data = {
#     "text": input_text
# }
#
#
# text = prompt.invoke(data)
#
# response = llm.invoke(text)
# print(response)


# Завдання 3
# Прочитайте файл data\lesson10\products.txt з описом
# Практичне завдання
# послуг СПА. Напишіть промпт для рекомендації послуги
# виходячи з запиту користувача
# Вхідні параметри – опис товарів, запит користувача
# Реалізуйте двома способами:
#  Zero-shot
#  Chain of Thoughts

with open("data/lesson10/products.txt", "r", encoding="utf-8") as f:
    products = f.read()

prompt = PromptTemplate.from_template("""
    Ти -- менеджер СПА.
    Твоє завдання полягає в наданні рекомендацій послуг на основі запиту клієнта.
    
    ###ОПИС СПА ПРОЦЕДУР###
    {products}
    
    ###ХІД ДУМОК###
    1. Розбери запит клієнта та вияви необхідну інформацію пов'язану з частинами тіла, ціною, тривалістю.
    2. ПОДИВИСЬ в описі спа процедур можливі процедури для клієнта
    3. Ще раз перевір та підбери найкращий варіант для клієнта
    
    ###ВХІДНІ ДАНІ###
    ЗАПИТ КОРИСТУВАЧА: {user_query}
""")

data = {
    "products": products,
    "user_query": "чи є у вас массаж для спини та не дорожче 1300 грн"
}

text = prompt.invoke(data)

response = llm.invoke(text)
print(response)