import dotenv
import os

from langchain_google_genai import ChatGoogleGenerativeAI
from langchain_core.messages import (
    HumanMessage,
    AIMessage,
    SystemMessage,
    trim_messages
)


dotenv.load_dotenv()
api_key = os.getenv("GEMINI_API_KEY")

llm = ChatGoogleGenerativeAI(
    model="gemini-3.5-flash-lite",
    api_key=api_key,
)


# Завдання 1
# Напишіть чат бота, який спілкується у стилі різних
# персонажів книг\фільмів або відомих людей. Ким саме бути
# чат бот вирішує з повідомлення від користувача.
# Якщо персонаж або книга невідомі, то відповісти що
# невідома інформація та запропонувати декілька відомих
# прикладів на вибір
# messages = [
#     SystemMessage("""
#     Ти — розумний чат-бот, який вміє перевтілюватись у персонажів книг, фільмів та відомих людей.
#
#     ###ПРАВИЛА###
#     1. Якщо користувач у своєму повідомленні вказує конкретного персонажа або відому людину
#        (наприклад: "поговори зі мною як Шерлок Холмс", "будь Гендальфом", "ти — Стів Джобс"),
#        то одразу перевтілюйся в цього персонажа та відповідай виключно в його стилі, манері
#        мовлення, характері та світогляді.
#
#     2. Якщо персонаж або твір тобі невідомі, або ти не маєш достатньо інформації щоб
#        переконливо його зіграти, — чесно повідом про це та запропонуй декілька відомих
#        прикладів персонажів на вибір, наприклад:
#        - Шерлок Холмс (детектив)
#        - Гендальф (Володар перснів)
#        - Гермiona Грейнджер (Гаррі Поттер)
#        - Стів Джобс (підприємець)
#        - Альберт Ейнштейн (фізик)
#        - Дарт Вейдер (Зоряні війни)
#
#     3. Залишайся в образі протягом усієї розмови, якщо користувач не просить змінити персонажа.
#
#     4. Якщо користувач просить змінити персонажа — одразу переключайся на нового.
#     """)
# ]
#
# while True:
#     user_text = input("Ви: ")
#
#     if user_text == '':
#         break
#
#     human_message = HumanMessage(user_text)
#
#     messages.append(human_message)
#
#     response = llm.invoke(messages)
#
#     print(f"AI: {response.content[0]['text']}")
#
#     messages.append(response)


# Завдання 2
# Напишіть чат бота, який дає відповіді на питання
# стосовно умов повернення товару.
# Якщо користувач запитує щось інше, то відповідати що
# немає інформації.
# Застосуйте обмеження історії(можна десь 5 повідомлень)

# trimmer = trim_messages(
#     strategy='last',
#     token_counter=len,
#     max_tokens=5,
#     start_on='human',
#     end_on='human',
#     include_system=True
# )
#
#
# messages = [
#     SystemMessage("""
#     Ти — консультант інтернет-магазину, який відповідає ВИКЛЮЧНО на питання
#     стосовно умов повернення товару.
#
#     ###УМОВИ ПОВЕРНЕННЯ###
#     - Термін повернення: 14 днів з моменту отримання товару
#     - Товар повинен бути в оригінальній упаковці та без слідів використання
#     - Повернення коштів: протягом 5 робочих днів після отримання товару назад
#     - Доставка при поверненні: за рахунок покупця
#     - Товари, що не підлягають поверненню: нижня білизна, парфумерія, програмне забезпечення
#     - Для оформлення повернення: зв'яжіться з підтримкою за номером 0-800-123-456
#
#     ###ПРАВИЛА###
#     1. Відповідай лише на питання про повернення товару.
#     2. Якщо питання не стосується повернення — ввічливо повідом, що не маєш такої інформації
#        та переспроси, чи є питання щодо повернення товару.
#     3. Давай чіткі та конкретні відповіді на основі умов повернення вище.
#     """)
# ]
#
# while True:
#     user_text = input("Ви: ")
#
#     if user_text == '':
#         break
#
#     human_message = HumanMessage(user_text)
#
#     messages.append(human_message)
#
#     messages = trimmer.invoke(messages)
#
#     response = llm.invoke(messages)
#
#     print(f"AI: {response.content}")
#
#     messages.append(response)


# Завдання 3
# Напишіть чат бота, який допомагає у вивченні
# англійської мови з наступним функціоналом:
#  якщо користувач просить перекласти слово або фразу
# то дається переклад слова та приклад використання в
# реченні
#  якщо користувач просить перекласти речення, то
# Практичне завдання
# дається переклад самого речення, а також пояснення
# граматики, наприклад структура there is\are, питання в
# різних часових формах, тощо.
# Приклади реалізуйте як HumanMessage та AIMessage

trimmer_3 = trim_messages(
    strategy='last',
    token_counter=len,
    max_tokens=9,
    start_on='human',
    end_on='human',
    include_system=True
)

messages_3 = [
    SystemMessage("""
    Ти — вчитель англійської мови. Допомагаєш користувачу вивчати англійську.

    ###ПРАВИЛА###
    1. Якщо користувач просить перекласти СЛОВО або ФРАЗУ:
       - Надай точний переклад
       - Наведи 2 приклади використання цього слова/фрази в реченні (англійською з перекладом)

    2. Якщо користувач просить перекласти РЕЧЕННЯ:
       - Надай точний переклад речення
       - Поясни граматичну структуру (наприклад: Present Simple, there is/are, питальна форма тощо)
       - Виділи ключові граматичні елементи

    3. Відповідай чітко та структуровано.
    """),
    HumanMessage("Перекладу слово: apple"),
    AIMessage("""
 **apple** — яблуко

 Приклади використання:
1. I eat an apple every morning. — Я їм яблуко кожного ранку.
2. She bought a bag of apples at the market. — Вона купила пакет яблук на ринку.
    """),

    HumanMessage("Перекладу речення: There are many students in the classroom."),
    AIMessage("""
 **Переклад:** У класній кімнаті багато учнів.

 **Граматика: структура there is / there are**
- **There are** використовується з іменниками у множині
- Структура: **There are + іменник (мн.) + місце**
- Питальна форма: **Are there many students in the classroom?**
- Заперечна форма: **There are no students in the classroom.**
    """),
]

while True:
    user_text = input("Ви: ")

    if user_text == '':
        break

    human_message = HumanMessage(user_text)

    messages_3.append(human_message)

    messages_3 = trimmer_3.invoke(messages_3)

    response = llm.invoke(messages_3)

    print(f"AI: {response.content}")

    messages_3.append(response)
